## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # argocd_application.locust is tainted, so must be replaced
-/+ resource "argocd_application" "locust" {
!       id      = "locus" -> (known after apply)
        # (2 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 13 -> (known after apply)
            name             = "locus"
!           resource_version = "3445632" -> (known after apply)
!           uid              = "a9b06535-4733-41e3-a993-efb4a7f5515c" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

!       spec {
            # (2 unchanged attributes hidden)

!           source {
                # (3 unchanged attributes hidden)

!               helm {
-                   skip_crds    = false -> null
-                   value_files  = [] -> null
                    # (1 unchanged attribute hidden)
                }
            }

            # (1 unchanged block hidden)
        }
    }

  # kubernetes_cluster_role.loadtesting_manager will be created
+   resource "kubernetes_cluster_role" "loadtesting_manager" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "loadtesting-manager-role"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       rule {
+           api_groups = [
+               "*",
            ]
+           resources  = [
+               "*",
            ]
+           verbs      = [
+               "*",
            ]
        }
+       rule {
+           non_resource_urls = [
+               "*",
            ]
+           verbs             = [
+               "*",
            ]
        }
    }

  # kubernetes_cluster_role_binding.loadtesting_manager will be created
+   resource "kubernetes_cluster_role_binding" "loadtesting_manager" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "loadtesting-manager-role-binding"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       role_ref {
+           api_group = "rbac.authorization.k8s.io"
+           kind      = "ClusterRole"
+           name      = "loadtesting-manager-role"
        }

+       subject {
+           api_group = (known after apply)
+           kind      = "ServiceAccount"
+           name      = "loadtesting-manager"
+           namespace = "kube-system"
        }
    }

  # kubernetes_service_account.loadtesting_manager will be updated in-place
!   resource "kubernetes_service_account" "loadtesting_manager" {
        id                              = "kube-system/loadtesting-manager"
        # (1 unchanged attribute hidden)

-       secret {
-           name = "loadtesting-manager-token-cd57s" -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 1 to change, 1 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
